Create a dataframe starting from a dictionary

In [1]:
import pandas as pd

In [4]:
student = {
    "weight": pd.Series([67, 68, 56, 78, 45, 68, 89, 102], ["Jose", "Anibal", "Rodolfo", "Margarita", "Carolina", "Augusto", "Juan", "Alberto"]),
    "height": pd.Series({"Jose":1.70, "Anibal":1.67, "Rodolfo":1.69, "Margarita":1.70, "Carolina":1.56, "Augusto":1.65, "Juan":1.79, "Alberto":1.78})
}

dataframe_student = pd.DataFrame(student)
dataframe_student

           weight  height
Jose           67    1.70
Anibal         68    1.67
Rodolfo        56    1.69
Margarita      78    1.70
Carolina       45    1.56
Augusto        68    1.65
Juan           89    1.79
Alberto       102    1.78

In [6]:
#filter from a dataframe
filter_df_student = pd.DataFrame(student, columns=["weight", "height"], index=["Jose", "Rodolfo", "Margarita"])
filter_df_student

           weight  height
Jose           67    1.70
Rodolfo        56    1.69
Margarita      78    1.70

Access to data from the dataframe separately

In [7]:
dataframe_student["weight"]

Jose          67
Anibal        68
Rodolfo       56
Margarita     78
Carolina      45
Augusto       68
Juan          89
Alberto      102
Name: weight, dtype: int64

In [8]:
dataframe_student["height"]

Jose         1.70
Anibal       1.67
Rodolfo      1.69
Margarita    1.70
Carolina     1.56
Augusto      1.65
Juan         1.79
Alberto      1.78
Name: height, dtype: float64

In [12]:
dataframe_student[dataframe_student["weight"] > 80]#index boolean value

         weight  height
Juan         89    1.79
Alberto     102    1.78

In [13]:
dataframe_student[(dataframe_student["weight"] > 65) & (dataframe_student["height"] > 1.65)] #index boolean

           weight  height
Jose           67    1.70
Anibal         68    1.67
Margarita      78    1.70
Juan           89    1.79
Alberto       102    1.78

In [14]:
dataframe_student.loc["Margarita"] #index row

weight    78.0
height     1.7
Name: Margarita, dtype: float64

In [15]:
dataframe_student.iloc[3:5]#index row section

           weight  height
Margarita      78    1.70
Carolina       45    1.56

In [16]:
dataframe_student.query("weight >= 65 and height >= 1.70")

           weight  height
Jose           67    1.70
Margarita      78    1.70
Juan           89    1.79
Alberto       102    1.78

In [18]:
df_s = dataframe_student.copy()#copy dataframe_student ==> df_s

In [22]:
df_s["IMC"] = df_s["weight"] / df_s["height"]**2 #add new column and operation imc
df_s

           weight  height        IMC
Jose           67    1.70  23.183391
Anibal         68    1.67  24.382373
Rodolfo        56    1.69  19.607157
Margarita      78    1.70  26.989619
Carolina       45    1.56  18.491124
Augusto        68    1.65  24.977043
Juan           89    1.79  27.776911
Alberto       102    1.78  32.192905